Revit 2027 API
DGNExportOptions.WorkingUnits Property
 If true, Main Units will be used. If false, Sub Units will be used. Default value of WorkingUnits is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WorkingUnits { get; set; }
Public Property WorkingUnits As Boolean
	Get
	Set
public:
property bool WorkingUnits {
	bool get ();
	void set (bool value);
}
member WorkingUnits : bool with get, set
Property Value
Boolean
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace